#include <stdio.h>

int main(int argc, char const *argv[])
{

	// int *p = (int *)0x08040000; // 0x08040000是保留区的地址，用户没有权限访问

	// *p = 100; // p == 0x08040000 ==> *p == *(0x08040000) ==> *p = 100 == *(0x08040000) = 100;

	// printf("address = %d\n", *p);
	int a[3][4] = {{
					   1,
					   2,
					   3,
					   4,
				   },
				   {
					   5,
					   6,
					   7,
					   8,
				   },
				   {9, 10, 11, 12}};

	printf("a[1][1] = %d\n", *(a[1] + 1));
	printf("a[1][1] = %d\n", *(&a[1][1]));
	printf("a[1][1] = %d\n", *(a + 1)[1]); //[] 优先级高于 *     (a + 1)[1] 等价于 *(a + 1 + 1)，
	printf("a[1][1] = %d\n", *a + 5);
	return 0;
}